JoseFrco16/STM32F446-Bootloader/Bootloader/Pal/Gpio/Gpio.c
/**
 ******************************************************************************
 * @file       Gpio.c
 * @name       JoseFrco16
 *******************************************************************************/

/* Includes ------------------------------------------------------------------ */
#include "Gpio.h"

#include "stm32f4xx_hal.h"

/* Define --------------------------------------------------------------------*/

/* Enum  ----------------------------------------------------------------------*/

/* Typedef -------------------------------------------------------------------*/
typedef struct
{
	uint32_t Pin;
	GPIO_TypeDef* Port;
}Gpio_CfgType;

/* Public variables ----------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
Gpio_CfgType Gpio_Cfg[ TOTAL_GPIO ] = {
	[ USER_LED ] = { .Pin = GPIO_PIN_5, .Port = GPIOA },
};

/* Private function prototypes -----------------------------------------------*/

/* Public Functions  ---------------------------------------------------------*/
void Gpio_Init()
{
	/* Enable CLK in Port A*/
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_USART2_CLK_ENABLE();

	GPIO_InitTypeDef GPIO_InitStruct =
	{ 0 };
	GPIO_InitStruct.Pin = GPIO_PIN_5;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_2;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

void Gpio_SetPin( Gpio_PinType Pin, Gpio_PinStateType State )
{
	return HAL_GPIO_WritePin( Gpio_Cfg[ Pin ].Port, Gpio_Cfg[ Pin].Pin, ( GPIO_PinState )State );
}

/* Private Functions  ---------------------------------------------------------*/
